HasSweptProfile Method
 Indicates if this instance can be represented as a swept profile.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public bool HasSweptProfile()
  Visual Basic
Public Function HasSweptProfile As Boolean
  Visual C++
public:
bool HasSweptProfile()
 Return Value
 True if the instance can be represented as a swept profile, false otherwise.
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →